import React from "react";
import "../styles/disclaimer.css"; 
import Footer from "../components/Footer/Footer";
import DynamicHeader from "../components/Header/DynamicHeader";

const AcceptableUsePolicyPage = () => {
   const role = localStorage.getItem("userRole");
  return (
    <>
    <DynamicHeader role={role} />    
      <div className="disclaimer-container">        
        <div className="disclaimer-content">
          <h1>Політика допустимого
          використання</h1>  
          <section>
           
            <p className="update-date">          
Ця Політика Допустимого Використання («Політика») визначає правила та вказівки щодо використання платформи Mindly («Платформа»). Отримавши доступ або використовуючи наші послуги, Клієнти погоджуються дотримуватися цієї Політики. Недотримання може призвести до обмеження доступу, закриття акаунту або юридичних наслідків.
<br/><br/>
Усі визначення та термінологія, що використовуються в цій Політиці, узгоджуються з тими, що викладені в Загальних Умовах та Положеннях, що забезпечує послідовність і ясність.
<br/><br/>
ДОТРИМАННЯ ЗАКОНУ<br/>
1.1. Клієнти Платформи повинні дотримуватися всіх чинних місцевих, національних і міжнародних законів і правил під час використання Платформи та її Сервісів.
<br/><br/>
ЗАБОРОНЕНА ДІЯЛЬНІСТЬ<br/>
2.1. Клієнти Платформи не повинні:
<br/>2.1.1. Порушувати будь-які закони, статути, постанови або правила, а також права третіх осіб, включаючи закони про інтелектуальну власність і захист даних.
<br/>2.1.2. Займатися переслідуванням, наклепом, розпалюванням ненависті, дискримінацією або будь-якою образливою чи принизливою поведінкою.
<br/>2.1.3. Видавати себе за інших осіб, надавати неправдиву інформацію або використовувати Платформу для шахрайської діяльності.
<br/>2.1.4. Завантажувати, поширювати або розповсюджувати шкідливе програмне забезпечення, небезпечні файли чи невідповідний контент.
<br/>2.1.5. Отримувати або намагатися отримати несанкціонований доступ до систем, даних або облікових записів користувачів.
<br/>2.1.6. Порушувати конфіденційність інших осіб, збираючи, зберігаючи або передаючи їхні особисті дані без відкритої згоди.
<br/>2.1.7. Розміщувати чи просувати відвертий або непристойний контент, який не відповідає цілям Mindly.
<br/>2.1.8. Брати участь у діяльності або просувати продукти чи послуги, що є незаконними або підлягають значним регуляторним обмеженням.
<br/><br/>КОРИСТУВАННЯ ПОСЛУГАМИ
<br/>3.1. Спеціалісти повинні надавати послуги в рамках своєї професійної кваліфікації та дотримуватися етичних і правових стандартів. Забороняється викривлення інформації про кваліфікацію або пропонування послуг, що виходять за межі компетенції.
<br/>3.2. Спеціалістам суворо забороняється проводити сеанси або намагатися вирішувати ситуації, які стосуються Пацієнтів, що знаходяться в екстреному стані.
<br/>3.3. Пацієнти повинні використовувати платформу виключно з метою отримання терапії або повʼязаних послуг. Використання платформи для будь-якої іншої експлуатації Спеціалістів суворо заборонено.
<br/>3.4. Клієнтам забороняється надмірне або деструктивне використання платформи, яке може вплинути на її доступність для інших користувачів.
<br/><br/>ПЛАТІЖНО-ФІНАНСОВІ ОПЕРАЦІЇ
<br/>4.1. Усі платежі, оброблені через Платформу, мають відповідати чинним фінансовим регуляціям, законодавству та Загальним Умовам і Положенням.
<br/>4.2. Клієнтам забороняється здійснювати шахрайські відкликання платежів, несанкціоновані скасування платежів або будь-яку діяльність, що підриває цілісність платіжних систем.
<br/><br/>БЕЗПЕКА ТА ЦІЛІСНІСТЬ ПЛАТФОРМИ
<br/>5.1. Для підтримки цілісності та безпеки Платформи Клієнти повинні:
<br/>5.1.1. Використовувати лише авторизовані облікові дані для доступу;
<br/>5.1.2. Утримуватися від впровадження шкідливого програмного забезпечення, скриптів або інструментів, які можуть завдати шкоди Платформі;
<br/>5.1.3. Негайно повідомляти команду підтримки Mindly про будь-які вразливості або порушення безпеки.
<br/><br/>ПОПРАВКИ
<br/>6.1. Mindly залишає за собою право оновлювати цю Політику в будь-який час. Подальше використання Платформи після внесення змін означає вашу згоду з оновленими умовами.
            </p>
          </section>      
        </div>             
      </div>
      <Footer />
    </>
  );
};

export default AcceptableUsePolicyPage;
