import React, { useEffect, useState } from "react";
import "../styles/disclaimer.css"; 
import Footer from "../components/Footer/Footer";
import Header from "../components/Header/Header";
import VariantHeaderNanny from "../components/Header/VariantHeaderNanny";
import VariantHeader from "../components/Header/VariantHeader";

const PrivacyPolicyPage = () => {
   const [userRole, setUserRole] = useState(null);
  
    useEffect(() => {
      const role = localStorage.getItem("userRole"); // "parent", "nanny", або null
      console.log("Роль користувача з localStorage:", role);
      setUserRole(role);
    }, []);
  
    const renderHeader = () => {
      if (!userRole) return <Header />;
      if (userRole === "parent") return <VariantHeader />;
      if (userRole === "nanny") return <VariantHeaderNanny />;
      return <Header />;
    };
  return (
    <>
     {renderHeader()}
      <div className="disclaimer-container">        
        <div className="disclaimer-content">
          <h1>Політика конфіденційності</h1>
          <p className="update-date"> Оновлено 20.08.2025</p>
          <section>
           
            <p className="update-date">          
Mindly («ми», «наш» або «нас») прагне захищати вашу конфіденційність. У цій Політиці конфіденційності пояснюється, як ваша особиста інформація збирається, використовується та розкривається Mindly.
<br/>
Ця Політика конфіденційності застосовується до нашого веб-сайту та пов’язаних із ним субдоменів (разом – «Сервіс»), а також до нашої програми Mindly. Отримуючи доступ або використовуючи наш Сервіс, ви підтверджуєте, що прочитали, зрозуміли та погоджуєтеся на збір, зберігання, використання та розкриття вашої особистої інформації, як описано в цій Політиці конфіденційності та наших Умовах обслуговування.
<br/><br/>
Визначення та ключові терміни
<br/>
Щоб якомога зрозуміліше пояснити речі в цій Політиці конфіденційності, кожен раз, коли згадується будь-який із цих термінів, вони суворо визначаються як:
<br/>
Файли cookie: невелика кількість даних, створених веб-сайтом і збережених вашим веб-браузером. Він використовується для ідентифікації вашого браузера, надання аналітики, запам’ятовування інформації про вас, такої як налаштування мови або дані для входу.
<br/>
Компанія: коли в цій політиці згадується «Компанія», «ми», «нас» або «наш», це стосується Mindly Europe OU, Ahtri tn 12, Tallinn 10151, Estonia, яка відповідає за вашу інформацію відповідно до цієї Політики конфіденційності.
<br/>
Країна: де розташовані Mindly або власники/засновники Mindly, у цьому випадку це Естонія
<br/>
Клієнт: означає компанію, організацію чи особу, яка реєструється для використання служби Mindly для керування відносинами з вашими споживачами або користувачами послуг.
<br/>
Пристрій: будь-який пристрій, підключений до Інтернету, наприклад телефон, планшет, комп’ютер або будь-який інший пристрій, який можна використовувати для відвідування Mindly і використання послуг.
<br/>
IP-адреса: кожному пристрою, підключеному до Інтернету, присвоюється номер, відомий як адреса Інтернет-протоколу (IP). Ці номери зазвичай призначаються географічними блоками. IP-адресу часто можна використовувати для визначення місця, з якого пристрій підключається до Інтернету.
<br/>
Персонал: відноситься до тих осіб, які працюють у Mindly або мають контракт для надання послуг від імені однієї зі сторін.
<br/>
Персональні дані: будь-яка інформація, яка прямо, опосередковано або у зв’язку з іншою інформацією, включаючи персональний ідентифікаційний номер, дозволяє ідентифікувати або ідентифікувати фізичну особу.
<br/>
Сервіс: відноситься до сервісу, який надає Mindly, як описано у відповідних умовах (якщо доступно) і на цій платформі.
<br/>
Послуги третіх сторін: стосуються рекламодавців, спонсорів конкурсів, рекламних і маркетингових партнерів та інших осіб, які надають наш вміст або чиї продукти чи послуги, на нашу думку, можуть вас зацікавити.
<br/>
Веб-сайт: сайт Mindly, доступ до якого можна отримати за цією URL-адресою: https://mindlyspace.com
<br/>
Ви: фізична або юридична особа, яка зареєстрована в Mindly для використання Послуг.
<br/><br/>
Яку інформацію ми збираємо?
<br/>
Ми збираємо інформацію від вас, коли ви відвідуєте наш веб-сайт/додаток, реєструєтесь на нашому сайті, розміщуєте замовлення, підписуєтесь на нашу розсилку, відповідаєте на опитування або заповнюєте форму.
<br/>
Ми також збираємо інформацію з мобільних пристроїв для кращої взаємодії з користувачем, хоча ці функції абсолютно необов’язкові:
<br/><br/>
Як ми використовуємо інформацію, яку збираємо?
<br/>
Будь-яка інформація, яку ми збираємо від вас, може бути використана одним із таких способів:
<br/>
Коли Mindly використовує інформацію кінцевого користувача від третіх сторін?
<br/>
Mindly збиратиме дані кінцевого користувача, необхідні для надання послуг Mindly нашим клієнтам.
<br/>
Кінцеві користувачі можуть добровільно надавати нам інформацію, яку вони опублікували на веб-сайтах соціальних мереж. Якщо ви надаєте нам таку інформацію, ми можемо збирати загальнодоступну інформацію з веб-сайтів соціальних мереж, які ви вказали. Ви можете контролювати, скільки вашої інформації веб-сайти соціальних мереж оприлюднюють, відвідавши ці веб-сайти та змінивши конфіденційність.
<br/><br/>
Чи передаємо ми зібрану інформацію третім особам?
<br/>
Ми можемо надавати інформацію, яку збираємо, як особисту, так і неособисту, третім особам, таким як рекламодавці, спонсори конкурсів, рекламні та маркетингові партнери та інші, які надають наш вміст або чиї продукти чи послуги, на нашу думку, можуть вас зацікавити. Ми також можемо ділитися нею з нашими поточними та майбутніми афілійованими компаніями та діловими партнерами, і якщо ми беремо участь у злитті, продажу активів або іншій реорганізації бізнесу, ми також можемо ділитися або передавати вашу особисту та неособисту інформацію нашим наступникам - інтерес.
<br/>
Ми можемо залучати довірених сторонніх постачальників послуг для виконання функцій і надання нам послуг, таких як розміщення та підтримка наших серверів і веб-сайту/програми, зберігання та керування базами даних, керування електронною поштою, маркетинг зберігання, обробка кредитних карток, обслуговування клієнтів та виконання замовлень на продукти та послуги, які ви можете придбати через веб-сайт/додаток. Ймовірно, ми надамо вашу особисту інформацію та, можливо, деяку неособисту інформацію цим третім особам, щоб вони могли надавати ці послуги для нас і для вас.
<br/>
Ми можемо ділитися частинами даних нашого журналу, включаючи IP-адреси, для цілей аналітики третім сторонам, таким як партнери з веб-аналітики, розробники додатків і рекламні мережі. Якщо ваша IP-адреса спільна, вона може використовуватися для оцінки загального розташування та інших технічних даних, таких як швидкість з’єднання, чи відвідували ви веб-сайт/додаток у спільному місці та тип пристрою, який використовується для відвідування веб-сайту/додатка. Вони можуть збирати інформацію про нашу рекламу та те, що ви бачите на веб-сайті/додатку, а потім надавати аудит, дослідження та звітність для нас і наших рекламодавців. Ми також можемо розкривати особисту та неособисту інформацію про вас представникам державних чи правоохоронних органів або приватним особам, якщо ми, на власний розсуд, вважаємо це необхідним або доречним для відповіді на претензії, судовий процес (включаючи повістки до суду), щоб захистити наші права та інтереси або інтереси третьої сторони, безпеку громадськості чи будь-якої особи, щоб запобігти або припинити будь-яку незаконну, неетичну чи юридичну діяльність або іншим чином виконувати відповідні судові розпорядження, закони, правила та положення.
<br/><br/>
Де і коли збирається інформація від клієнтів і кінцевих користувачів?
<br/>
Mindly збиратиме особисту інформацію, яку ви нам надсилаєте. Ми також можемо отримувати особисту інформацію про вас від третіх осіб, як описано вище.
<br/><br/>
Як ми використовуємо вашу електронну адресу?
<br/>
Надсилаючи свою адресу електронної пошти на цьому веб-сайті/додатку, ви погоджуєтесь отримувати електронні листи від нас. Ви можете скасувати свою участь у будь-якому з цих списків розсилки в будь-який час, натиснувши посилання для відмови або іншу опцію скасування підписки, яка міститься у відповідному електронному листі. Ми надсилаємо електронні листи лише тим людям, які дозволили нам зв’язуватися з ними безпосередньо чи через третю сторону. Ми не надсилаємо небажаних комерційних електронних листів, тому що ненавидимо спам так само, як і ви. Надсилаючи свою адресу електронної пошти, ви також погоджуєтеся використовувати вашу адресу електронної пошти для націлювання на аудиторію клієнтів на таких сайтах, як Facebook, де ми показуємо спеціальну рекламу конкретним людям, які погодилися отримувати від нас повідомлення. Адреси електронної пошти, надіслані лише на сторінці обробки замовлення, використовуватимуться виключно з метою надсилання вам інформації та оновлень, що стосуються вашого замовлення. Однак якщо ви надали нам ту саму електронну адресу іншим способом, ми можемо використовувати її для будь-якої з цілей, зазначених у цій Політиці. Примітка. Якщо в будь-який момент ви захочете скасувати підписку на отримання електронних листів у майбутньому, ми додаємо детальні інструкції щодо скасування підписки внизу кожного електронного листа.
<br/><br/>
Як довго ми зберігаємо вашу інформацію?
<br/>
Ми зберігаємо вашу інформацію лише до тих пір, поки вона нам потрібна для надання вам Mindly і досягнення цілей, описаних у цій політиці. Це також стосується всіх, кому ми надаємо вашу інформацію та хто надає послуги від нашого імені. Коли нам більше не потрібно буде використовувати вашу інформацію та зберігати її для дотримання наших юридичних або нормативних зобов’язань, ми або видалимо її з наших систем, або знеособимо, щоб ми не могли ідентифікувати вас.
<br/><br/>
Як ми захищаємо вашу інформацію?
<br/>
Ми застосовуємо низку заходів безпеки, щоб забезпечити безпеку вашої особистої інформації, коли ви розміщуєте замовлення або вводите, надсилаєте або отримуєте доступ до вашої особистої інформації. Ми пропонуємо використовувати захищений сервер. Уся надана конфіденційна/кредитна інформація передається через технологію Secure Socket Layer (SSL), а потім шифрується в нашій базі даних постачальників платіжних шлюзів, щоб мати доступ до неї лише особам, уповноваженим на спеціальні права доступу до таких систем, і зобов’язаним зберігати конфіденційність інформації. Після транзакції ваша особиста інформація (кредитні картки, номери соціального страхування, фінансові дані тощо) ніколи не зберігається у файлі. Однак ми не можемо гарантувати або гарантувати абсолютну безпеку будь-якої інформації, яку ви передаєте Mindly, або гарантувати, що ваша інформація на Сервісі не може бути доступна, розголошена, змінена чи знищена через порушення будь-якої нашої фізичної, технічної чи управлінської гарантії.
<br/><br/>
Чи може моя інформація бути передана в інші країни?
<br/>
Mindly зареєстрована в Естонії. Інформація, зібрана через наш веб-сайт, через пряму взаємодію з вами або в результаті використання наших довідкових служб, може час від часу передаватись до наших офісів чи персоналу чи третім сторонам, розташованим у всьому світі, і може переглядатися та розміщуватися будь-де в світу, включаючи країни, які можуть не мати законів загального застосування, що регулюють використання та передачу таких даних. У повному обсязі, дозволеному чинним законодавством, використовуючи будь-що з вищезазначеного, ви добровільно погоджуєтеся на транскордонну передачу та розміщення такої інформації.
<br/><br/>
Чи захищена інформація, зібрана через службу Mindly?
<br/>
Ми вживаємо заходів для захисту вашої інформації. У нас є фізичні, електронні та управлінські процедури, які допомагають захистити, запобігти несанкціонованому доступу, підтримувати безпеку даних і правильно використовувати вашу інформацію. Однак ані люди, ані системи безпеки не є надійними, включаючи системи шифрування. Крім того, люди можуть скоювати навмисні злочини, робити помилки або не виконувати політику. Таким чином, хоча ми докладаємо розумних зусиль для захисту вашої особистої інформації, ми не можемо гарантувати її абсолютну безпеку. Якщо застосовне законодавство накладає обов’язок щодо захисту вашої особистої інформації, який не підлягає запереченню, ви погоджуєтеся, що навмисне порушення буде стандартом, який використовується для вимірювання дотримання цим обов’язком.
<br/><br/>
Чи можу я оновити або виправити свою інформацію?
<br/>
Ваші права вимагати оновлення або виправлення інформації, яку Mindly збирає, залежать від ваших відносин із Mindly. Персонал може оновлювати або виправляти свою інформацію, як зазначено у внутрішніх правилах працевлаштування нашої компанії.
<br/>
Клієнти мають право вимагати обмеження певного використання та розкриття особистої інформації, як зазначено нижче. Ви можете зв’язатися з нами, щоб (1) оновити або виправити вашу особисту інформацію, (2) змінити свої налаштування щодо повідомлень та іншої інформації, яку ви отримуєте від нас, або (3) видалити особисту інформацію, яка зберігається про вас на нашому системи (з урахуванням наступного абзацу), скасувавши свій обліковий запис. Такі оновлення, виправлення, зміни та видалення не впливатимуть на іншу інформацію, яку ми зберігаємо, або інформацію, яку ми надали третім особам відповідно до цієї Політики конфіденційності до такого оновлення, виправлення, зміни чи видалення. Щоб захистити вашу конфіденційність і безпеку, ми можемо вжити розумних заходів (наприклад, запросити унікальний пароль), щоб підтвердити вашу особу, перш ніж надавати вам доступ до профілю або вносити виправлення. Ви несете відповідальність за збереження в таємниці свого унікального пароля та інформації облікового запису в будь-який час.
<br/>
Ви повинні знати, що технологічно неможливо видалити з нашої системи кожен запис інформації, яку ви надали нам. Необхідність резервного копіювання наших систем для захисту інформації від ненавмисної втрати означає, що копія вашої інформації може існувати в нестираемій формі, яку нам буде важко або неможливо знайти. Негайно після отримання вашого запиту вся особиста інформація, що зберігається в базах даних, які ми активно використовуємо, та в інших медіафайлах, доступних для пошуку, буде оновлена, виправлена, змінена або видалена, залежно від обставин, якомога швидше та в обсязі, який є розумно та технічно можливим.
<br/>
Якщо ви є кінцевим користувачем і бажаєте оновити, видалити або отримати будь-яку інформацію, яку ми маємо про вас, ви можете зробити це, звернувшись до організації, клієнтом якої ви є.
<br/><br/>
Персонал
<br/>
Якщо ви є працівником Mindly або заявником, ми збираємо інформацію, яку ви надаєте нам добровільно. Ми використовуємо зібрану інформацію в цілях відділу кадрів, щоб надавати пільги працівникам і перевіряти кандидатів.
<br/>
Ви можете зв’язатися з нами, щоб (1) оновити чи виправити вашу інформацію, (2) змінити свої налаштування щодо повідомлень та іншої інформації, яку ви отримуєте від нас, або (3) отримати запис інформації, яку ми маємо щодо вас. Такі оновлення, виправлення, зміни та видалення не впливатимуть на іншу інформацію, яку ми зберігаємо, або інформацію, яку ми надали третім особам відповідно до цієї Політики конфіденційності до такого оновлення, виправлення, зміни чи видалення.
<br/><br/>
Продаж бізнесу
<br/>
Ми залишаємо за собою право передавати інформацію третій стороні у разі продажу, злиття чи іншої передачі всіх або практично всіх активів Mindly або будь-якої з її Корпоративних філій (як визначено тут), або такої частини Mindly або будь-яка з її Корпоративних філій, до яких відноситься Сервіс, або у випадку, якщо ми припиняємо наш бізнес, подаємо петицію або подали проти нас петицію у справі про банкрутство, реорганізацію чи подібну процедуру, за умови, що третя сторона погоджується дотримуватися умов цієї Політики конфіденційності.
<br/><br/>
Філії
<br/>
Ми можемо розкривати інформацію (включаючи особисту інформацію) про вас нашим корпоративним афілійованим особам. Для цілей цієї Політики конфіденційності «Корпоративна афілійована особа» означає будь-яку фізичну або юридичну особу, яка прямо чи опосередковано контролює, контролюється Mindly або перебуває під спільним контролем з Mindly, незалежно від права власності чи іншим чином. Будь-яка інформація про вас, яку ми надаємо нашим Корпоративним афілійованим особам, буде оброблятися цими Корпоративними афілійованими особами відповідно до умов цієї Політики конфіденційності.
<br/><br/>
Правом, що регулює
<br/>
Ця Політика конфіденційності регулюється законодавством Естонії без урахування колізійного права. Ви погоджуєтеся на виключну юрисдикцію судів у зв’язку з будь-якими діями чи суперечками, що виникають між сторонами відповідно до цієї Політики конфіденційності або у зв’язку з нею, за винятком тих осіб, які можуть мати право подавати претензії відповідно до Privacy Shield або швейцарсько-американської угоди.
<br/>
Закони Естонії, за винятком колізійних норм, регулюють цю Угоду та використання вами веб-сайту/додатку. Використання вами веб-сайту/програми також може регулюватися іншими місцевими, державними, національними чи міжнародними законами.
<br/>
Використовуючи Mindly або звертаючись безпосередньо до нас, ви підтверджуєте свою згоду з цією Політикою конфіденційності. Якщо ви не згодні з цією Політикою конфіденційності, вам не слід працювати з нашим веб-сайтом або користуватися нашими послугами. Продовження використання веб-сайту, безпосередня взаємодія з нами або публікація змін до цієї Політики конфіденційності, які суттєво не впливають на використання чи розкриття вашої особистої інформації, означатимуть, що ви приймаєте ці зміни.
<br/><br/>
Ваша згода
<br/>
Ми оновили нашу Політику конфіденційності, щоб надати вам повну прозорість щодо того, що встановлюється, коли ви відвідуєте наш сайт, і як він використовується. Використовуючи наш веб-сайт/додаток, реєструючи обліковий запис або роблячи покупку, ви погоджуєтеся з нашою Політикою конфіденційності та її умовами.
<br/><br/>
Посилання на інші веб-сайти
<br/>
Ця Політика конфіденційності стосується лише Послуг. Послуги можуть містити посилання на інші веб-сайти, якими не керує Mindly. Ми не несемо відповідальності за зміст, точність або думки, висловлені на таких веб-сайтах, і такі веб-сайти не досліджуються, не контролюються та не перевіряються на точність або повноту. Будь ласка, пам’ятайте, що коли ви використовуєте посилання для переходу з Послуг на інший веб-сайт, наша Політика конфіденційності більше не діє. Ваш перегляд і взаємодія на будь-якому іншому веб-сайті, включно з тими, які мають посилання на нашій платформі, регулюється власними правилами та політикою цього веб-сайту. Такі треті сторони можуть використовувати власні файли cookie або інші методи для збору інформації про вас.
<br/><br/>
Реклама
<br/>
Цей веб-сайт/програма може містити рекламу третіх сторін і посилання на сторонні сайти. Mindly не робить жодних заяв щодо точності чи придатності будь-якої інформації, що міститься в цих рекламних оголошеннях або на сайтах, і не бере на себе жодної відповідальності за поведінку чи зміст цих рекламних оголошень і сайтів, а також пропозицій, зроблених третіми сторонами.
<br/>
Реклама зберігає Mindly і багато веб-сайтів і послуг, якими ви користуєтеся безкоштовно. Ми наполегливо працюємо над тим, щоб реклама була безпечною, ненав’язливою та максимально релевантною.
<br/>
Реклама третіх сторін і посилання на інші сайти, де рекламуються товари або послуги, не є підтримкою або рекомендацією Mindly щодо сайтів, товарів або послуг третіх сторін. Mindly не несе відповідальності за зміст будь-якої реклами, дані обіцянки або якість/надійність продуктів чи послуг, які пропонуються в усіх рекламах.
<br/><br/>
Файли cookie для реклами
<br/>
Ці файли cookie з часом збирають інформацію про вашу онлайн-діяльність на веб-сайті/додатку та в інших онлайн-сервісах, щоб зробити онлайн-рекламу більш актуальною та ефективною для вас. Це відомо як реклама на основі інтересів. Вони також виконують такі функції, як запобігання постійному повторному показу тієї самої реклами та забезпечення правильного відображення реклами для рекламодавців. Без файлів cookie рекламодавцю дуже важко охопити свою аудиторію або дізнатися, скільки оголошень було показано та скільки кліків вони отримали.
            </p>
          </section>      
        </div>
      

        <Footer />
      </div>
    </>
  );
};

export default PrivacyPolicyPage;
