import React from "react";
import "../styles/disclaimer.css"; 
import Footer from "../components/Footer/Footer";
import DynamicHeader from "../components/Header/DynamicHeader";

const TermsAndConditionsPage = () => {
   const role = localStorage.getItem("userRole");

  return (
    <>
      <DynamicHeader role={role} />
      <div className="disclaimer-container">        
        <div className="disclaimer-content">
          <h1>ЗАГАЛЬНІ УМОВИ ТА ПОЛОЖЕННЯ</h1>
          <p className="update-date">ЗАГАЛЬНІ УМОВИ ТА ПОЛОЖЕННЯ</p>        
          <section>
           
            <p className="update-date">
           
Визначення
<br/>
Акаунт: Унікальний акаунт для доступу до Платформи.
<br/>
Додаток: Програмне забезпечення Mindly, доступне через App Store або Google Play.
<br/>
Платформа: Додаток і Веб-сайт разом.
<br/>
Спеціаліст: Фахівець, зареєстрований на Платформі для надання послуг.
<br/>
Пацієнт: Особа, яка шукає психотерапевтичну допомогу.
<br/>
Підписка: Доступ до послуг психотерапії через платформу.
<br/>
Пробний Сеанс: Перший сеанс терапії з новим спеціалістом.
<br/>
<br/>
Загальні умови
<br/>
Доступ до послуг на платформі залежить від прийняття цих умов.
<br/>
Пацієнт має бути старше 18 років або мати дозвіл від батьків.
<br/>
Особисті дані обробляються згідно з Політикою конфіденційності.
<br/>
<br/>
Медичне застереження
<br/>
Послуги не призначені для надзвичайних випадків.
<br/>
Платформа не забезпечує медичну діагностику або лікування.
<br/>
У разі серйозних симптомів слід звертатися до лікаря.
<br/>
<br/>
Створення акаунту
<br/>
Для створення акаунту потрібно зареєструватися через додаток або веб-сайт.
<br/>
Клієнт не повинен передавати свій пароль третім особам.
<br/><br/>
Надання послуг
<br/>
Mindly надає платформу для зв'язку спеціалістів і пацієнтів.<br/>
Сеанси проводяться через відеоконференції чи дзвінки.<br/>
Пацієнт має право на перепланування сеансів за певних умов.<br/><br/>
Підписки
<br/>
Платформа пропонує місячні, квартальні та піврічні підписки на терапевтичні послуги.
<br/>
Підписка автоматично оновлюється після кожного платіжного циклу.<br/><br/>
Подарункові картки
<br/>
Подарункові картки можна придбати на платформі.<br/>
Вони діють протягом 12 місяців і можуть бути використані для часткової або повної оплати послуг.
<br/><br/>
Відповідальність
<br/>
Загальна відповідальність Mindly обмежується сумою, сплаченою Клієнтом через платформу.
<br/>Mindly не несе відповідальності за шкоду, завдану Пацієнтам спеціалістами.
<br/><br/>Обмеження акаунту
<br/>
<br/>Mindly має право обмежити доступ до акаунту в разі порушення цих умов.
<br/><br/>Закриття акаунту
<br/>
<br/>Mindly може закрити акаунт за порушення умов або за запитом клієнта.
<br/>Клієнт втрачає доступ до незаброньованих сеансів при закритті акаунту.
<br/><br/>Повідомлення
<br/>
<br/>Повідомлення між сторонами повинні подаватися в письмовій формі через платформу.
<br/><br/>Інше
<br/>
<br/>Ці умови регулюються законами Естонії.
<br/>У разі виникнення суперечок, вони вирішуються в суді округу Хар'ю.
<br/>Let me know if you'd like further modifications or have specific sections that need more focus!
<br/><br/>
Загальні Умови та Положення
<br/>
Визначення
<br/>
У цьому розділі наведені визначення, які застосовуються до цих Загальних Умов та Положень і Договору між Пацієнтом і Спеціалістом, а також щодо доступу до Платформи Mindly.
<br/>
Акаунт: Унікальний акаунт, створений Клієнтом для доступу до Платформи та її Послуг.
<br/>Додаток: Програмне забезпечення Mindly, яке Клієнт завантажує на свій електронний пристрій. Це може бути додаток для Спеціалістів (Mindly Therapist) та для Пацієнтів (Mindly Therapy).
<br/>Платформа: Сукупність Додатку та Веб-сайту, які дозволяють Пацієнтам та Спеціалістам взаємодіяти для надання та отримання послуг.
<br/>Спеціаліст: Особа, яка надає послуги психотерапії або психології через Платформу.
<br/>Пацієнт: Фізична особа, яка шукає консультації або терапію на Платформі.
<br/>Договір Пацієнта: Угода між Пацієнтом і Спеціалістом для надання сеансів терапії.
<br/>Підписка: Доступ до послуг терапії через Платформу на основі підписки.
<br/><br/>Загальні Умови
<br/>
<br/>Прийняття умов: Для доступу до Послуг Клієнт має прийняти ці Загальні Умови. Це обов'язкове для використання Платформи та отримання послуг.
<br/>Вік Пацієнта: Пацієнт повинен бути старше 18 років або мати дозвіл батьків для використання Платформи, якщо він є неповнолітнім.
<br/>Конфіденційність: Клієнт погоджується з тим, що його персональні дані будуть оброблятися відповідно до Політики конфіденційності, що доступна на Веб-сайті Mindly.
<br/><br/>Медичне Застереження
<br/>
<br/>Невідкладні ситуації: Послуги, що надаються на Платформі, не є заміною медичного обстеження або екстреної допомоги. Пацієнти, які мають думки про самопошкодження або інші серйозні психічні чи фізичні симптоми, повинні звернутися до лікаря чи екстрену службу.
<br/>Виключення: Платформа не призначена для надання медичних рецептів або клінічної діагностики.
<br/><br/>Створення Акаунту
<br/>
<br/>Процес реєстрації: Для створення акаунту Пацієнт має завантажити відповідний Додаток або зареєструватися на Веб-сайті, вказавши електронну адресу і вибравши пароль.
<br/>Безпека акаунту: Пацієнт зобов'язаний зберігати свій пароль в таємниці та негайно змінити його, якщо він став доступним третій стороні.
<br/>Вхід до акаунту: Для входу на Платформу Пацієнт використовує свою електронну адресу та пароль. Дії, виконані через акаунт, вважаються підписом Пацієнта.
<br/><br/>Надання Послуг
<br/>
<br/>Платформа як посередник: Mindly надає Платформу для зручного зв'язку між Спеціалістами та Пацієнтами, але не бере на себе відповідальність за самі сеанси терапії.
<br/>Терапевтичні сеанси: Сеанси терапії проводяться через відеоконференції чи аудіодзвінки між Пацієнтом та Спеціалістом.
<br/>Перепланування сеансів: Пацієнти та Спеціалісти мають можливість переплановувати сеанси, дотримуючись визначених термінів.
<br/><br/>Підписки
<br/>
<br/>Типи підписок: Mindly пропонує різні типи підписок: місячну, квартальну та піврічну. Кожен план включає певну кількість сеансів терапії, які автоматично оновлюються після закінчення платіжного циклу.
<br/>Оплата: Пацієнт здійснює попередню оплату за підписку на Платформі. Залишки на рахунку Підписки можуть бути використані на сеанси терапії.
<br/>Скасування підписки: Пацієнт може скасувати свою підписку в будь-який час, але не отримає повернення за вже сплачений період. Скасування повинно бути зроблене до наступного автоматичного поновлення.
<br/><br/>Подарункові Картки
<br/>
<br/>Придбання: Подарункові картки можна придбати через Платформу. Вони можуть бути використані для оплати Пробних Сеансів або Підписок.
<br/>Термін дії: Подарункові картки дійсні протягом 12 місяців з дати покупки. Залишок після закінчення терміну дії не підлягає поверненню.
<br/>Повернення коштів: Якщо сеанс або підписка оплачено подарунковою карткою, повернення коштів здійснюється через поповнення балансу картки.
<br/><br/>Відповідальність
<br/>
<br/>Обмеження відповідальності: Mindly не несе відповідальності за будь-які шкоди, завдані Спеціалістами або Пацієнтами. Загальна відповідальність Mindly обмежується сумою, яку Пацієнт сплатив за послуги на платформі.
<br/>Забезпечення кваліфікації: Спеціалісти повинні мати відповідну освіту та ліцензії для надання послуг через Платформу.
<br/><br/>Обмеження Акаунту
<br/>
<br/>Блокування акаунту: Mindly має право обмежити доступ до акаунту або заблокувати його в разі порушення умов, шахрайської діяльності або підозри на несанкціонований доступ.
<br/><br/>Закриття Акаунту
<br/>
<br/>Причини закриття акаунту: Mindly може закрити акаунт за порушення умов або на запит клієнта. У разі закриття акаунту Пацієнт втрачає доступ до незаброньованих сеансів.
<br/><br/>Повідомлення
<br/>
<br/>Порядок повідомлень: Повідомлення між сторонами надсилаються через Платформу, і вважаються доставленими після підтвердження системою.
<br/><br/>Інші Положення
<br/>
<br/>Зміни в умовах: Mindly має право змінювати ці умови в односторонньому порядку, якщо це необхідно для вдосконалення послуг або відповідності законодавству.
<br/>Юрисдикція: Ці умови регулюються законодавством Естонії. Спори вирішуються в суді Хар'ю.
            </p>
          </section>      
        </div>    
      </div>
     <Footer />
    </>
  );
};

export default TermsAndConditionsPage;
